Revit 2024 API
ArrayAnchorMember Enumeration
 Represents the possible choices for how the translation or rotation is used to place each member of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum ArrayAnchorMember
Visual Basic
Public Enumeration ArrayAnchorMember
Visual C++
public enum class ArrayAnchorMember
Members
Member name | Description
Second |  The translation or rotation value specifies the location of the second member of the array.
Last |  The translation or rotation value specifies the location of the last member of the array.
See Also
Autodesk.Revit.DB Namespace